[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
я
и
не
что
на
в
с
могу
но
ты
знаю
за
это
есть
вы
мне
хочу
всё
лицо
глаза
к
больше
бы
только
из
то
ежели
для
по
без
перед
быть
люблю
голову
глядя
ничего
у
чтобы
меня
смерть
надо
жить
верю
улыбкой
о
сел
тяжело
глаз
все
сидел
рукой
него
руки
от
он
вас
а
было
бог
как
завтра
говорить
увидев
отчего
во
стал
шёл
себя
стоял
молча
наташу
пьера
руку
неё
время
потому
нет
никогда
может
человек
тебе
чем
вот
бога
плакать
чувствую
счастье
жизнь
мира
громко
руками
засмеялся
слушая
платье
покрылось
при
резко
стол
стукнул
пол
письмо
опустил
приподняла
рот
солдат
столу
кошелёк
комнаты
улыбнулся
получив
отвернулся
схватился
грудь
перестали
дыша
бледно
отошёл
вздрогнул
пошла
так
сильно
облокотившись
низко
взял
отца
вышел
увидел
её
она
после
глазами
его
смертью
до
всех
небо
будете
можете
даже
один
был
хочешь
счастлив
тобой
можно
там
знаешь
посылают
куда
этого
делать
знал
прежде
любить
верить
умереть
ждать
войны
солдатом
просто
час
терпеть
век
отсутствие
страдания
тебя
пробуждение
любовь
счастлива
жизни
была
истина
мы
несчастья
буду
необходимое
условие
правда
сон
встречает
первого
гостя
отработанной
жестом
приглашения
говорит
анной
павловной
меняя
позы
вслушиваясь
начал
размахивать
рассказывая
анекдот
первый
дожидаясь
реакции
виконта
шевелилась
смотрела
одну
точку
поправила
складку
обвела
зал
взглядом
красными
пятнами
разговоре
женихе
вошёл
быстрыми
шагами
тростью
об
требуя
тишины
читая
жюли
вздохнула
перекрестилась
князя
андрея
тотчас
приняла
красивую
томную
позу
разговаривая
женой
закрыл
губку
сделала
белочки
зевнул
перекрестил
вздохнул
разутых
краснея
заикаясь
объяснял
пропажу
денег
гневе
кулаком
воруя
поднимал
побледнело
бросил
телянину
выбежал
хлопнув
дверью
сидя
сапог
смущённо
багратиону
зажмуривал
втягивал
плечи
покусывал
трубку
искры
летели
стороны
приказ
отходить
ответил
землю
коне
каменным
лицом
багратиона
подтянулись
перешёптываться
пьёт
смотрит
пьеру
стоит
расставив
ноги
прищурился
целиться
челюсть
тряслась
медленно
боком
спотыкаясь
отвернувшись
рука
спиной
вытянутой
боясь
убить
пистолет
шатаясь
бледность
закрытые
кровь
искривлён
стон
ухватившись
траву
крик
барьеру
вслух
приговаривая
лестнице
оправляла
зеркалом
видя
никого
вокруг
сердце
билось
отдавало
виски
косяк
глядел
толпу
указал
кивнул
андрею
подняла
испуганные
осветилось
счастливой
положила
плечо
вальсировать
сводил
поправляя
розу
корсажа
усаживалась
подле
стояла
опустив
потуплены
поднималась
чуть
заметно
подошёл
ней
кланяясь
вспыхнула
нахмурившись
опустила
дышала
видимо
устав
танцев
лёгким
румянцем
своей
самоуверенной
талию
прижав
себе
элен
замерла
испуганный
взгляд
переходил
прощаясь
сыном
сунул
ему
конверт
обняв
дома
оглядываясь
родах
кричала
ужасным
голосом
губы
запеклись
остекленели
войдя
жене
страдальческую
улыбку
услышал
детский
плач
прислонившись
стене
бессмысленно
улыбался
умирая
костра
обхватив
колени
казнь
мог
отвести
хлопнул
плечу
подмигнул
отвечая
французу
странным
смехом
николая
ростова
выпрямилась
кресле
слёзы
текли
щекам
вытирала
их
проигравшись
вернулся
домой
клавикордам
несколько
аккордов
замер
уронив
запела
громче
веселее
отвлечь
брата
объяснения
николаем
выбежала
слезах
танцуя
данилу
купора
топал
смеялся
лавке
постукивал
пальцами
встрече
наташей
театре
навёл
лорнет
оглянулась
встретившись
ним
покраснела
вечере
дипломата
наклонилась
швырнул
тарелку
взяла
выдернул
привале
завернулся
шинель
затих
освобождённый
плена
плакал
обнимая
лошадь
накануне
бородина
прервал
разговор
окну
распустив
мундир
слушал
открыл
единственный
зрячий
посмотрел
генералов
бородино
палатки
махнул
теребил
перчатку
донесения
надели
чистые
белые
рубахи
перекличке
выпучив
атакой
перекрестился
сжал
эфес
сабли
побелевших
пальцев
полз
волоча
перебитую
ногу
гибелью
подпрыгивал
седле
размахивая
саблей
отстранил
смотрел
потолок
застонал
сне
пожара
москвы
сжав
кулаки
скрипел
зубами
сына
прижала
груди
покачивалась
ядовито
улыбнулась
указала
дверь
ночное
широко
распахнула
засмеялась
предупреждаю
отвечать
скажете
понять
почему
говорю
наполеон
велик
выше
революции
убийства
герцога
самые
пристрастные
люди
видеть
нем
героя
нельзя
политике
удержаться
прошу
messieurs
говорите
рыцарей
женись
мой
друг
понимаю
мужчина
свободен
дорог
особенно
живой
среди
всего
нашего
света
красивейший
умнейший
мире
сию
минуту
просил
вашей
будь
им
оттого
дорожу
твоей
дружбой
одним
чувствовать
человеком
мама
посмотреть
гостиной
ни
отказать
дипломат
туда
пгхвоста
телянина
говогит
деньги
пгопил
думаете
честный
офицер
хотите
вам
судья
богом
ребята
голубчик
спасибо
прекрасная
оно
которого
ныне
пустое
обман
кроме
бесконечного
неба
посмотри
луна
дочь
слуга
сказали
должна
умерла
радостью
зачем
еду
ехать
понимаете
женитесь
жениться
женщине
которую
уважаю
здесь
пришёл
смешны
вашими
рассуждениями
добродетели
шутить
такими
вещами
готов
когда
обманывают
лучше
русского
солдата
выдержит
сделает
великого
смешного
шаг
будут
воевать
своим
убеждениям
всяких
привилегий
где
суд
неправда
понял
петь
отказаться
дала
слово
государя
отечество
знать
одного
были
счастливы
держу
поезжай
зла
будущая
добродетель
кончается
тридцать
лет
самого
со
мной
думаем
нас
выкинет
привычной
дорожки
пропало
тужи
дружок
шахматы
поставлены
игра
начнётся
приходит
вовремя
того
кто
умеет
свете
иначе
должен
заплатить
допустить
рисковали
жизнью
моих
фантазий
идём
верную
хочется
поговорить
жил
славы
других
ошибкой
спроси
мамы
ли
выйти
замуж
ещё
ребёнок
рано
думать
замужестве
создал
людей
страдание
постижения
истины
думаешь
сделал
ошибку
можешь
исправить
вспомнить
вчера
помню
простота
прекрасного
простит
прости
христа
ради
терпение
мои
воины
богатыри
прочного
гарантированного
вечный
мир
возможность
вечного
уже
сегодня
честь
единственное
потерять
партизанская
война
поэзия
случай
предопределено
случайности
существует
имеет
причину
два
действительных
угрызения
совести
болезнь
совесть
голос
человеке
объяснить
вера
дел
мертва
дела
веры
механические
действия
маленькая
умирать
выдерживает
проверку
временем
масло
всегда
наверх
всплывёт
россия
спасена
благодарю
франция
великой
создан
счастья
птица
полёта
том
любимой
